<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads AVG Anti-virus for MacOS Installer and extracts the embedded package, uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.pasd-tech.jss.AVGAntiVirus</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utility</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>AVGAntiVirus</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Beneath its deceptively simple design lies a powerful virus cleaner that works in real-time to detect and remove not only Mac-specific viruses and spyware, but PC and mobile threats, too. So AVG AntiVirus not only helps protect all that's important on your Mac, it also prevents you from infecting friends on other devices.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>AVGAntiVirus.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.pasd_tech.download.AVGAntiVirus</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
