<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest AVGAntiVirus client for macOS</string>
    <key>Identifier</key>
    <string>com.github.pasd_tech.download.AVGAntiVirus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AVGAntiVirus</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.avg.com/ww-en/download-file-mac-av</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
		<key>version</key>
		<string>%version%</string>
            </dict>	    
        </dict>
 <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install AVG AntiVirus.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: AVG Technologies CZ, s.r.o. (XSJ59WMJBM)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            	<dict>
		        	<key>flat_pkg_path</key>
		        	<string>%pathname%/Install AVG AntiVirus.pkg</string>
		        	<key>destination_path</key>
		        	<string>%RECIPE_CACHE_DIR%/downloads</string>
	            </dict>
	            <key>Processor</key>
            	<string>FlatPkgUnpacker</string>
		       <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
               	<dict>
				<key>source_pkg</key>
                <string>%pathname%/Install AVG AntiVirus.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-.pkg</string>
           	 	</dict>   
        </dict>
    </array>
</dict>
</plist>
